tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"

brew "ansible"
brew "ansible-lint"
brew "aspell"
brew "awscli"
brew "bash"
brew "bat"
brew "binutils"
brew "composer"
brew "coreutils"
brew "diffutils"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "getmail"
brew "gifsicle"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "go"
brew "gotop"
brew "grep"
brew "gzip"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "less"
brew "make"
brew "media-info"
brew "n"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "pandoc"
brew "perl"
brew "php"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rbenv-default-gems"
brew "readline"
brew "ripgrep"
brew "shellcheck"
brew "ssh-copy-id"
brew "tag"
brew "teensy_loader_cli"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "vim"
brew "watch"
brew "wget"
brew "xz"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "zsh"

cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "istat-menus"
cask "kitty"
cask "slack"
cask "transmit"
cask "ubersicht"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
